; domain
(define (domain progetto)
    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions :action-costs :equality)

    (:types
        cell - object
        tile - object
        tile_3 tile_5 tile_6 tile_7 tile_9 tile_a tile_b tile_c tile_d tile_e tile_f - tile
    )

    (:predicates
        ; per creare la griglia
        (is_above ?c1 - cell ?c2 - cell)
        (is_right ?c1 - cell ?c2 - cell)

        ; per indicare quali tile sono gia' state usate
        (used ?t - tile)

        ; per ridurre la complessita' delle precondizioni - senza questo predicato non funziona
        (has_tile ?c - cell)

        (open_left ?c - cell)
        (open_right ?c - cell)
        (open_above ?c - cell)
        (open_below ?c - cell)


        ; per indicare se abbiamo messo la prima tile
        (first_tile_positioned)

    )

    (:functions
        (total-cost)
    )


    ;############################################### TILE 3 ###############################################

    (:action place_tile_3
        :parameters (?c - cell ?t - tile_3)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o a sx ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile a dx
            ; deve essere di tipo { 3, 6, 7, a, b, e, f }
                         
        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            
            ; deve esserci almeno una cella c2 a dx o a sx con un oro o una tile
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                ; oppure c'e' una cella o a dx o a sx che ha una tile, e se ci sono celle a dx o sx con tile
                ; devono essere tile appropriate
            
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        
                    )
                        
                        
                )
                    ; se una cella c2 e' a dx o a sx e ha una tile, deve essere appropriata
                
            )

        )

        :effect (and
        
            (has_tile ?c)
            (open_right ?c)
            (open_left ?c)
            
            ; t e' usata
            (used ?t)


            ; segna che abbiamo messo (almeno) una tile
            (first_tile_positioned)


            (increase (total-cost) 6)
        )

    )

    


    ;############################################### TILE 5 ###############################################

    (:action place_tile_5
        :parameters (?c - cell ?t - tile_5)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                ; deve esserci almeno una cella c2 a dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)  
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                        
                )

              
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 2)       
        )
    )



    ;############################################### TILE 6 ###############################################

    (:action place_tile_6
        :parameters (?c - cell ?t - tile_6)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella a sx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)                     
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                    )
                        
                )
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 2)
            
        )
    )



    ;############################################### TILE 7 ###############################################


    (:action place_tile_7
        :parameters (?c - cell ?t - tile_7)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
    
            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

               
                    ; deve esserci almeno una cella c2 a sx o dx o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)     
                            (open_right ?c2)                     
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                        
                )
                    ; o a sx o dx o sotto ci deve essere un oro o una tile
                  
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             

            (increase (total-cost) 8)
        )
    )


    
    ;############################################### TILE 9 ###############################################


    (:action place_tile_9
        :parameters (?c - cell ?t - tile_9)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))
            

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or

                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                    
                )
                    ; o a dx o sopra ci deve essere un oro o una tile
                   
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )


    
    ;############################################### TILE A ###############################################

    (:action place_tile_a
        :parameters (?c - cell ?t - tile_a)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))

                
                    ; deve esserci almeno una cella c2 a sx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                    )
                        
                )
                    ; o a sx o sopra ci deve essere un oro o una tile
                    
                
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_left ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 2)
        )
    )



    
    ;############################################### TILE B ###############################################


    (:action place_tile_b
        :parameters (?c - cell ?t - tile_b)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella c2 a sx o dx o sopra con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        
                            
                    )
                        
                )
                    ; o a sx o dx o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_right ?c)
            (open_above ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)
           
        )
    )



    
    ;############################################### TILE C ###############################################

    (:action place_tile_c
        :parameters (?c - cell ?t - tile_c)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra
            ; deve essere: { 5, 6, 7, c, d, e, f }


        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
               
                    ; deve esserci almeno una cella sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                        
                )
                    ; su ogni cella o sotto o sopra ci deve essere un oro o una tile appropriata
                    
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 6)
            
        )
    )


    
    ;############################################### TILE D ###############################################


    (:action place_tile_d
        :parameters (?c - cell ?t - tile_d)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

        

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))

            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                    ; o a dx o sotto o sopra ci deve essere un oro o una tile
                    
                       
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_below ?c)
            (open_above ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 8)
           
        )
    )


    
    ;############################################### TILE E ###############################################

    
    (:action place_tile_e
        :parameters (?c - cell ?t - tile_e)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile sotto deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere
            ; di tipo: { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))

        
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                ; deve esserci almeno una cella a sx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                    
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                        
                    )
                            
                )

                    ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_left ?c)
            (open_above ?c)
            (open_below ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

             
            (increase (total-cost) 8)   
            
        )
    )



    
    ;############################################### TILE F ###############################################


    (:action place_tile_f
        :parameters (?c - cell ?t - tile_f)
        
        :precondition (and
            ; non ci deve essere una tile, in una casella o a sx o dx o sotto o sopra ci deve essere o un oro o una tile,
            ; e se c'e' una tile a dx deve essere di tipo: { 3, 6, 7, a, b, e, f }, se c'e' una tile sotto
            ; deve essere di tipo { 9, a, b, c, d, e, f }, se c'e' una tile a sx deve essere di tipo:
            ; { 3, 5, 7, 9, b, d, f }, se c'e' una tile sopra deve essere: { 5, 6, 7, c, d, e, f }

            ; t non deve essere gia' stata utilizzata
            (not (used ?t))
            
            ; non ci deve essere una tile su c
            (not (has_tile ?c))


            (or
                ; o non abbiamo ancora messo nessuna tile
                (not (first_tile_positioned))
            
                
                    ; deve esserci almeno una cella a sx o dx o sopra o sotto con un oro o una tile
                (exists (?c2 - cell)
                
                    (or
                        (and
                            (is_right ?c ?c2)
                            (open_right ?c2)
                        )
                        (and
                            (is_right ?c2 ?c)
                            (open_left ?c2)
                        )
                        (and
                            (is_above ?c2 ?c)
                            (open_below ?c2)
                        )
                        (and
                            (is_above ?c ?c2)
                            (open_above ?c2)
                        )
                        
                        
                    )
                            
                )
                ; o a sx o dx o sotto o sopra ci deve essere un oro o una tile
                   
            )
        )

        :effect (and
            ; c'e' la tile t su c
            
            (has_tile ?c)
            (open_above ?c)
            (open_below ?c)
            (open_left ?c)
            (open_right ?c)

            ; t e' usata
            (used ?t)

            ; segna che la cella e' ok
              

            (first_tile_positioned)

            (increase (total-cost) 15)

        )
    )

)

; problem
(define (problem problem3)
	(:domain progetto)
	(:objects
		c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 c19 c20 c21 c22 c23 c24 c25 c26 c27 c28 c29 c30 c31 c32 c33 c34 c35 c36 c37 c38 c39 c40 c41 c42 c43 c44 c45 c46 c47 c48 c49 c50 c51 c52 c53 c54 c55 c56 c57 c58 c59 c60 c61 c62 c63 c64 c65 c66 c67 c68 c69 c70 c71 c72 c73 c74 c75 c76 c77 c78 c79 c80 c81 c82 c83 c84 c85 c86 c87 c88 c89 c90 c91 c92 c93 c94 c95 c96 c97 c98 c99 c100 c101 c102 c103 c104 c105 c106 c107 c108 c109 c110 c111 c112 c113 c114 c115 c116 c117 c118 c119 c120 - cell
		t3_1 t3_2 t3_3 t3_4 t3_5 - tile_3
		t5_1 t5_2 t5_3 t5_4 t5_5 t5_6 - tile_5
		t6_1 t6_2 t6_3 t6_4 t6_5 - tile_6
		t7_1 t7_2 t7_3 t7_4 - tile_7
		t9_1 t9_2 t9_3 t9_4 t9_5 t9_6 t9_7 - tile_9
		ta_1 ta_2 ta_3 ta_4 ta_5 - tile_a
		tb_1 tb_2 tb_3 tb_4 tb_5 tb_6 - tile_b
		tc_1 tc_2 tc_3 tc_4 tc_5 - tile_c
		td_1 td_2 td_3 td_4 - tile_d
		te_1 te_2 te_3 te_4 te_5 - tile_e
		tf_1 tf_2 tf_3 tf_4 tf_5 tf_6 - tile_f
	)
	(:init
		(is_above c1 c13)
		(is_above c2 c14)
		(is_above c3 c15)
		(is_above c4 c16)
		(is_above c5 c17)
		(is_above c6 c18)
		(is_above c7 c19)
		(is_above c8 c20)
		(is_above c9 c21)
		(is_above c10 c22)
		(is_above c11 c23)
		(is_above c12 c24)
		(is_above c13 c25)
		(is_above c14 c26)
		(is_above c15 c27)
		(is_above c16 c28)
		(is_above c17 c29)
		(is_above c18 c30)
		(is_above c19 c31)
		(is_above c20 c32)
		(is_above c21 c33)
		(is_above c22 c34)
		(is_above c23 c35)
		(is_above c24 c36)
		(is_above c25 c37)
		(is_above c26 c38)
		(is_above c27 c39)
		(is_above c28 c40)
		(is_above c29 c41)
		(is_above c30 c42)
		(is_above c31 c43)
		(is_above c32 c44)
		(is_above c33 c45)
		(is_above c34 c46)
		(is_above c35 c47)
		(is_above c36 c48)
		(is_above c37 c49)
		(is_above c38 c50)
		(is_above c39 c51)
		(is_above c40 c52)
		(is_above c41 c53)
		(is_above c42 c54)
		(is_above c43 c55)
		(is_above c44 c56)
		(is_above c45 c57)
		(is_above c46 c58)
		(is_above c47 c59)
		(is_above c48 c60)
		(is_above c49 c61)
		(is_above c50 c62)
		(is_above c51 c63)
		(is_above c52 c64)
		(is_above c53 c65)
		(is_above c54 c66)
		(is_above c55 c67)
		(is_above c56 c68)
		(is_above c57 c69)
		(is_above c58 c70)
		(is_above c59 c71)
		(is_above c60 c72)
		(is_above c61 c73)
		(is_above c62 c74)
		(is_above c63 c75)
		(is_above c64 c76)
		(is_above c65 c77)
		(is_above c66 c78)
		(is_above c67 c79)
		(is_above c68 c80)
		(is_above c69 c81)
		(is_above c70 c82)
		(is_above c71 c83)
		(is_above c72 c84)
		(is_above c73 c85)
		(is_above c74 c86)
		(is_above c75 c87)
		(is_above c76 c88)
		(is_above c77 c89)
		(is_above c78 c90)
		(is_above c79 c91)
		(is_above c80 c92)
		(is_above c81 c93)
		(is_above c82 c94)
		(is_above c83 c95)
		(is_above c84 c96)
		(is_above c85 c97)
		(is_above c86 c98)
		(is_above c87 c99)
		(is_above c88 c100)
		(is_above c89 c101)
		(is_above c90 c102)
		(is_above c91 c103)
		(is_above c92 c104)
		(is_above c93 c105)
		(is_above c94 c106)
		(is_above c95 c107)
		(is_above c96 c108)
		(is_above c97 c109)
		(is_above c98 c110)
		(is_above c99 c111)
		(is_above c100 c112)
		(is_above c101 c113)
		(is_above c102 c114)
		(is_above c103 c115)
		(is_above c104 c116)
		(is_above c105 c117)
		(is_above c106 c118)
		(is_above c107 c119)
		(is_above c108 c120)

		(is_right c2 c1)
		(is_right c3 c2)
		(is_right c4 c3)
		(is_right c5 c4)
		(is_right c6 c5)
		(is_right c7 c6)
		(is_right c8 c7)
		(is_right c9 c8)
		(is_right c10 c9)
		(is_right c11 c10)
		(is_right c12 c11)
		(is_right c14 c13)
		(is_right c15 c14)
		(is_right c16 c15)
		(is_right c17 c16)
		(is_right c18 c17)
		(is_right c19 c18)
		(is_right c20 c19)
		(is_right c21 c20)
		(is_right c22 c21)
		(is_right c23 c22)
		(is_right c24 c23)
		(is_right c26 c25)
		(is_right c27 c26)
		(is_right c28 c27)
		(is_right c29 c28)
		(is_right c30 c29)
		(is_right c31 c30)
		(is_right c32 c31)
		(is_right c33 c32)
		(is_right c34 c33)
		(is_right c35 c34)
		(is_right c36 c35)
		(is_right c38 c37)
		(is_right c39 c38)
		(is_right c40 c39)
		(is_right c41 c40)
		(is_right c42 c41)
		(is_right c43 c42)
		(is_right c44 c43)
		(is_right c45 c44)
		(is_right c46 c45)
		(is_right c47 c46)
		(is_right c48 c47)
		(is_right c50 c49)
		(is_right c51 c50)
		(is_right c52 c51)
		(is_right c53 c52)
		(is_right c54 c53)
		(is_right c55 c54)
		(is_right c56 c55)
		(is_right c57 c56)
		(is_right c58 c57)
		(is_right c59 c58)
		(is_right c60 c59)
		(is_right c62 c61)
		(is_right c63 c62)
		(is_right c64 c63)
		(is_right c65 c64)
		(is_right c66 c65)
		(is_right c67 c66)
		(is_right c68 c67)
		(is_right c69 c68)
		(is_right c70 c69)
		(is_right c71 c70)
		(is_right c72 c71)
		(is_right c74 c73)
		(is_right c75 c74)
		(is_right c76 c75)
		(is_right c77 c76)
		(is_right c78 c77)
		(is_right c79 c78)
		(is_right c80 c79)
		(is_right c81 c80)
		(is_right c82 c81)
		(is_right c83 c82)
		(is_right c84 c83)
		(is_right c86 c85)
		(is_right c87 c86)
		(is_right c88 c87)
		(is_right c89 c88)
		(is_right c90 c89)
		(is_right c91 c90)
		(is_right c92 c91)
		(is_right c93 c92)
		(is_right c94 c93)
		(is_right c95 c94)
		(is_right c96 c95)
		(is_right c98 c97)
		(is_right c99 c98)
		(is_right c100 c99)
		(is_right c101 c100)
		(is_right c102 c101)
		(is_right c103 c102)
		(is_right c104 c103)
		(is_right c105 c104)
		(is_right c106 c105)
		(is_right c107 c106)
		(is_right c108 c107)
		(is_right c110 c109)
		(is_right c111 c110)
		(is_right c112 c111)
		(is_right c113 c112)
		(is_right c114 c113)
		(is_right c115 c114)
		(is_right c116 c115)
		(is_right c117 c116)
		(is_right c118 c117)
		(is_right c119 c118)
		(is_right c120 c119)


		(= (total-cost) 0)
	)
	(:goal
		(and
			(has_tile c28)
			(has_tile c57)
			(has_tile c108)
			(has_tile c111)
		)
	)
	(:metric
		minimize (total-cost)
	)
)

; plan
1. (place_tile_3 c57 t3_1)
   added: (has_tile c57) (open_right c57) (open_left c57) (used t3_1) (first_tile_positioned)
   goals met: 1 of 4
2. (place_tile_6 c58 t6_1)
   added: (has_tile c58) (open_below c58) (open_left c58) (used t6_1)
   goals met: 1 of 4
3. (place_tile_c c70 tc_1)
   added: (has_tile c70) (open_above c70) (open_below c70) (used tc_1)
   goals met: 1 of 4
4. (place_tile_9 c82 t9_1)
   added: (has_tile c82) (open_above c82) (open_right c82) (used t9_1)
   goals met: 1 of 4
5. (place_tile_6 c83 t6_2)
   added: (has_tile c83) (open_below c83) (open_left c83) (used t6_2)
   goals met: 1 of 4
6. (place_tile_9 c95 t9_2)
   added: (has_tile c95) (open_above c95) (open_right c95) (used t9_2)
   goals met: 1 of 4
7. (place_tile_6 c96 t6_3)
   added: (has_tile c96) (open_below c96) (open_left c96) (used t6_3)
   goals met: 1 of 4
8. (place_tile_9 c108 t9_3)
   added: (has_tile c108) (open_above c108) (open_right c108) (used t9_3)
   goals met: 2 of 4
9. (place_tile_3 c56 t3_2)
   added: (has_tile c56) (open_right c56) (open_left c56) (used t3_2)
   goals met: 2 of 4
10. (place_tile_5 c55 t5_1)
   added: (has_tile c55) (open_below c55) (open_right c55) (used t5_1)
   goals met: 2 of 4
11. (place_tile_a c67 ta_1)
   added: (has_tile c67) (open_above c67) (open_left c67) (used ta_1)
   goals met: 2 of 4
12. (place_tile_9 c66 t9_4)
   added: (has_tile c66) (open_above c66) (open_right c66) (used t9_4)
   goals met: 2 of 4
13. (place_tile_6 c54 t6_4)
   added: (has_tile c54) (open_below c54) (open_left c54) (used t6_4)
   goals met: 2 of 4
14. (place_tile_9 c53 t9_5)
   added: (has_tile c53) (open_above c53) (open_right c53) (used t9_5)
   goals met: 2 of 4
15. (place_tile_6 c41 t6_5)
   added: (has_tile c41) (open_below c41) (open_left c41) (used t6_5)
   goals met: 2 of 4
16. (place_tile_9 c40 t9_6)
   added: (has_tile c40) (open_above c40) (open_right c40) (used t9_6)
   goals met: 2 of 4
17. (place_tile_7 c28 t7_1)
   added: (has_tile c28) (open_below c28) (open_left c28) (open_right c28) (used t7_1)
   goals met: 3 of 4
18. (place_tile_5 c27 t5_2)
   added: (has_tile c27) (open_below c27) (open_right c27) (used t5_2)
   goals met: 3 of 4
19. (place_tile_c c39 tc_2)
   added: (has_tile c39) (open_above c39) (open_below c39) (used tc_2)
   goals met: 3 of 4
20. (place_tile_c c51 tc_3)
   added: (has_tile c51) (open_above c51) (open_below c51) (used tc_3)
   goals met: 3 of 4
21. (place_tile_c c63 tc_4)
   added: (has_tile c63) (open_above c63) (open_below c63) (used tc_4)
   goals met: 3 of 4
22. (place_tile_c c75 tc_5)
   added: (has_tile c75) (open_above c75) (open_below c75) (used tc_5)
   goals met: 3 of 4
23. (place_tile_d c87 td_1)
   added: (has_tile c87) (open_below c87) (open_above c87) (open_right c87) (used td_1)
   goals met: 3 of 4
24. (place_tile_d c99 td_2)
   added: (has_tile c99) (open_below c99) (open_above c99) (open_right c99) (used td_2)
   goals met: 3 of 4
25. (place_tile_9 c111 t9_7)
   added: (has_tile c111) (open_above c111) (open_right c111) (used t9_7)
   goals met: 4 of 4
